#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# 102. Напишіть програму, в якій користувач вводить пароль і якщо він співпадає із наперед визначеним паролем для цього користувача,
# то виводиться повідомлення Password accepted.. У іншому випадку повідомлення буде Sorry, that is the wrong password..

# count = 0
# while True:
#     try:
#         password = input('Enter passwor: ')
#
#         if password == 'done':
#             break
#
#         if count == 2:
#             print('you are a dick... fuck off')
#             break
#
#         if password == 'starlink':
#             print('Password accepted.')
#             break
#         else:
#             count = count + 1
#             print('Sorry, that is the wrong password.')
#
#         if count == 2:
#             print('the last try...')
#     except:
#         print('Try againe')
#     continue
#
# print('дякую')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# 103. Користувачем вводиться два імені.
# Використовуючи конструкцію розгалуження програма повинна вивести імена в алфавітному порядку.
#
# f_name = input('Enter first name: ')
# s_name = input('Enter second name: ')
#
# if f_name[0] < s_name[0]:
#     print(f_name, s_name, sep='\n')
# else:
#     print(s_name, f_name, sep='\n')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# 104. Напишіть програму, яка виводить назви введених чисел. Користувач вводить ціле число.
# Якщо це число або 1 або 2 або 3, то виводиться повідомлення - назва числа, відповідно, One, Two, Three.
# В усіх інших випадках виводиться слово Unknown.
from stringprep import b1_set

# num = int(input('Enter a number: '))
#
# if num == 1:
#     print('One')
# elif num == 2:
#     print('Two')
# elif num == 3:
#     print('Three')
# else:
#     print('unknown')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#105. Користувач вводить дві різних англійські літери в окремих рядках.
# Напишіть програму, яка виводить повідомлення про місце розташування однієї літери відносно іншої у алфавіті.
#
# f_letter = input('Enter first letter: ')
# s_letter = input('Enter second letter: ')
#
# if f_letter > s_letter:
#     print(f'{f_letter} is not greater than {s_letter}')
# else:
#     print(f'{s_letter} is not greater than {f_letter}')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# 106. Напишіть програму, в якій користувач вводить значення температури, і, якщо це значення менше або дорівнює 0 градусів Цельсія, н
# еобхідно вивести повідомлення A cold, isn’t it?. Якщо ж температура становить більше 0 і менше 10 градусів Цельсія повідомлення буде Cool.,
# у інших випадках Nice weather we’re having..

# a = float(input('Enter: '))
#
# if a < 0:
#     print('A cold, isn’t it?')
# elif (a > 0) and (a < 10):
#     print('Cool.')
# else:
#     print('Nice weather we’re having.')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#107. У чемпіонаті з футболу команді за виграш дається 3 очка, за програш - 0, за нічию - 1.
# Відомо кількість очок, отриманих командою за гру.
# Вивести результат гри у вигляді відповідних слів: «виграш», «програш» або «нічия».
# a = int(input('Enter: '))
# if a == 3:
#     print('win')
# elif a == 1:
#     print('draw')
# elif a == 0:
#     print('lose')
# else:
#     print('unknown')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#108. Відомі дві швидкості: одна в кілометрах за годину, інша - в метрах за секунду. Яка з швидкостей більше?
# a_km_p_h = 60
# b_m_p_s = 18
#
# b_km_p_h = b_m_p_s * 3.6
#
# if a_km_p_h > b_km_p_h:
#     print(a_km_p_h)
# else:
#     print(b_m_p_s)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# 109. Дано радіус кола і сторона квадрата (дійсні числа). У якої фігури площа більше?
# import math
#
# circle = float(input('Enter a radius: '))
# square = float(input('Enter a side of a square: '))
#
# s_circle = math.pi * circle**2
# s_square = square * square
#
# if s_circle > s_square:
#     print('Circle')
# else:
#     print('Square')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# 110. Дано маси і об’єми двох тіл, виготовлених з різних матеріалів (дійсні числа).
# Матеріал якого з тіл має більшу густину? Введення величин відбувається у такому порядку: m1, v1, m2, v2.
#
# m1 = float(input('Enter the mass of the first body: '))
# v1 = float(input('Enter the volume of the first body: '))
# m2 = float(input('Enter the mass of the second body: '))
# v2 = float(input('Enter the mass of the second body: '))
#
# p1 = m1 / v1
# p2 = m2 / v2
#
# if p1 > p2:
#     print('The density of the first body is greater')
# else:
#     print('The density of the second body is greater')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# 111. Серед учнів школи проводилося тестування з трьох предметів, по кожному з яких учні отримали певну кількість балів (цілі числа).
# Напишіть програму, яку можуть використати учні для обчислення їхнього середнього балу трьох тестів і виведення середнього значення.
# Окрім того, необхідно передбачити виведення повідомлення Congratulations! That is a great average!, якщо середній бал більший ніж 95.
#
# s1 = int(input('Enter your math score: '))
# s2 = int(input('Enter your literature score: '))
# s3 = int(input('Enter your history score: '))
#
# average_score = (s1+s2+s3)/3
# print(f'Your average score: {average_score:.2f}')
#
# if average_score > 95:
#     print('Congratulations! That is a great average!')
# else:
#     print('You failed...')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#114. Напишіть програму, щоб перевірити, чи є введене число додатним, від’ємним або це нуль.
# num = float(input('Enter a number: '))
#
# if num > 0:
#     print('It is positive number')
# if num == 0:
#     print('It is Zero')
# if num < 0:
#     print('It is a negative number')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#116. Напишіть програму, яка друкує Yes, якщо вводяться рядки yes або YES або Yes, у інших випадках друкує No.
#
# word = input('Enter: ')
# low_word = word.lower()
#
# if low_word == 'yes':
#     print('Yes')
# else:
#     print('No')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# 117. Дано три цілих числа. Визначте, скільки серед них збігаються.
# Програма повинна вивести одне з чисел: 3 (якщо усі однакові), 2 (якщо два однакові) або 0 (якщо усі числа різні).
#
# num1 = int(input('Enter first number: '))
# num2 = int(input('Enter second number: '))
# num3 = int(input('Enter third number: '))
#
# count = 0
#
# if (num1 == num2) and (num2 == num3):
#     count = count + 3
# elif (num1 == num2) and (num2 != num3):
#     count = count + 2
# elif (num1 != num2) and (num2 == num3):
#     count = count + 2
# elif (num1 != num2) and (num1 == num3):
#     count = count + 2
# elif (num1 != num2) and (num2 != num3):
#     count = count
#
# print(count)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#118. Напишіть програму, яка визначає поведінку космічного апарата, що стартує на екваторі,
# залежно від його початкової швидкості v, заданої у км/с (дійсні числа).
# Як ви знаєте з уроків фізики, тут можливі чотири випадки:
# при v < 7,8 км/с апарат впаде на поверхню Землі;
# при 7,8 ≤ v < 11,2 км/с апарат стане супутником Землі;
# при 11,2 ≤ v < 16,4 км/с апарат стане супутником Сонця;
# при v ≥ 16,4 км/с космічний апарат покине Сонячну систему.
#
# v = float(input('Enter a speed of starship: '))
#
# if v < 7.8:
#     print('The starship fell down...and by a lucky coincidence destroy the Kremlin!!!! team posthumous heroes!!!!\nСЛАВА УКРАЇНІ, справжні козаки!!!')
# elif (v >= 7.8) and (v < 11.2):
#     print('The device became a satellite of the Earth.')
# elif (v >= 11.2) and (v < 16.4):
#     print('The device became a satellite of the Sun.')
# else:
#     print('The device left the Solar system.')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# 120. Автомобіль подолав відстань s км через населений пункт за t хв.
# Визначити, чи не порушив водій правил дорожнього руху, якщо швидкість автомобіля при цьому не повинна перевищувати 60 км/год.
#
# v = float(input('Enter a distance: '))
# t_m = int(input('Enter a time: '))
#
# t_h = t_m / 60
# s = v / t_h
# print(s)
# if s <= 60:
#     print('Traffic rules are executed.')
# else:
#     print('Traffic rules are not met.')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#122. Дано п’ять цілих чисел a, b, c, d, e. Визначити, скільки з них додатних.
#
# a = -3
# b = -2
# c = -5
# d = -1
# e = -1
#
# count = 0
#
# if a > 0:
#     count = count + 1
# if b > 0:
#     count = count + 1
# if c > 0:
#     count = count + 1
# if d > 0:
#     count = count + 1
# if e > 0:
#     count = count + 1
#
# print(count)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#123. Дано ціле число a. Знайти значення виразу: a/(|a|-10). Врахувати у програмі випадок, коли відбувається ділення на нуль.
# while True:
#     try:
#         num = int(input('Enter: '))
#
#         f = num / (abs(num) - 10)
#
#         print(f)
#     except ZeroDivisionError:
#         print('Division by zero!')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#124. Напишіть програму, яка запитує користувача номер в діапазоні від 1 до 7.
# Програма повинна відображати відповідний день тижня, де 1 - це понеділок, а 7 - неділя.
# Програма має враховувати варіант, коли користувач вводить номер, що знаходиться за межами діапазону від 1 до 7.
#
# while True:
#
#     day = input('Enter a dae number(1-7): ')
#
#     if day == 'done':
#         print('Well done, good by')
#         break
#
#     if day == '1':
#         print('Mondey')
#     elif day == '2':
#         print('Tuesday')
#     elif day == '3':
#         print('Wednesday')
#     elif day == '4':
#         print('Thursday')
#     elif day == '5':
#         print('Friday')
#     elif day == '6':
#         print('Saturday')
#     elif day == '7':
#         print('Sunday')
#     else:
#         print('There is no such day of the week.')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#127. Дату 2 жовтня 2020 р. будемо називати «магічною», оскільки, коли вона записана у форматі 02.10.20,
# добуток значень дня і місяця дорівнюють значенню року.
# Напишіть програму, яка запропонує користувачеві ввести день, місяць і рік (лише останні дві цифри) у числовій формі.
# Програмі слід вивести повідомлення про те, що введена дата є «магічною».
# В іншому випадку має бути повідомлення, що це звичайна дата.
# while True:
#
#     day = 2
#     month = int(input('Enter a month of your birth Day: '))
#     year = int(input('Enter a year of your birth Day: '))
#
#     if (day*month) == year:
#         print('The date is magic!')
#     else:
#         print('No!')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#128. Червоний, зелений та синій кольори відомі як основні кольори колірної моделі RGB.
# При змішуванні червоного та зеленого кольорів, отримується жовтий, при змішуванні синього і зеленого - блакитний,
# а при змішуванні синього і червоного – пурпуровий колір.
# Напишіть програму, яка запропонує користувачеві ввести назви двох основних кольорів для змішування.
# Якщо користувач вводить щось інше, ніж «червоний», «синій» або «зелений»,
# програма повинна виводити повідомлення про відсутність такої палітри.
# В іншому випадку програма повинна відображати назву кольору, що утворився.
# while True:
#
#     color_a = input('Enter a first color: ')
#     color_b = input('Enter a second color: ')
#
#     if ((color_a == 'red') and (color_b == 'green')) or ((color_a == 'green') and (color_b == 'red')):
#         print('Yellow')
#     elif ((color_a == 'red') and (color_b == 'blue')) or ((color_a == 'blue') and (color_b == 'red')):
#         print('Magenta')
#     elif ((color_a == 'green') and (color_b == 'blue')) or ((color_a == 'blue') and (color_b == 'green')):
#         print('Purple')
#     else:
#         print('No such color')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#130. Компанія-виробник програмного забезпечення у сфері інформаційної безпеки реалізує один комплект програм за 2700 гривень.
# Якщо відбувається купівля декількох одиниць товару, працює система знижок:
# 10-19 одиниць товару - 10%,
# 20-49 - 20%,
# 50-99 - 30%,
# 100 або більше - 40%.
# Напишіть програму, яка отримує від користувача ціле число - кількість придбаних комплектів програмного забезпечення і
# виводить повідомлення про суму знижки (якщо така є) та загальну суму при купівлі зі знижкою.
#
# while True:
#
#     price_of_kit = 2700
#     discount = 0
#     kit = int(input('Enter how much kits do you wont: '))
#
#     if kit < 10:
#         price = price_of_kit * kit
#         print(f'The amount of discount is {discount}%, total amount of the purchase after the discount is UAH {price}')
#     elif (kit >= 10) and (kit < 20):
#         discount = 10
#         price = (price_of_kit * kit) * (1 - (discount/100))
#         print(f'The amount of discount is {discount}%, total amount of the purchase after the discount is UAH {price}')
#     elif (kit >= 20) and (kit < 50):
#         discount = 20
#         price = (price_of_kit * kit) * (1 - (discount/100))
#         print(f'The amount of discount is {discount}%, total amount of the purchase after the discount is UAH {price}')
#     elif (kit >= 50) and (kit < 100):
#         discount = 30
#         price = (price_of_kit * kit) * (1 - (discount / 100))
#         print(f'The amount of discount is {discount}%, total amount of the purchase after the discount is UAH {price}')
#     elif kit >= 100:
#         discount = 40
#         price = (price_of_kit * kit) * (1 - (discount / 100))
#         print(f'The amount of discount is {discount}%, total amount of the purchase after the discount is UAH {price}')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#131. Напишіть програму, на вхід якої подається назва місяця, а програма виводить кількість днів у ньому.
# Врахуйте те, що місяць «Лютий» може мати 28 або 29 днів.
# while True:
#
#     mon = input('Enter a month: ')
#     month = mon.lower()
#
#     if (month == 'january') or (month == 'march') or (month == 'may') or (month == 'july')  or (month == 'august') or (month == 'october') or (month == 'december'):
#         print(f'{mon.upper()} has 31 days in it.')
#     elif (month == 'april') or (month == 'june') or (month == 'september') or (month == 'November'):
#         print(f'{mon} has 30 days in it.')
#     elif month == 'february':
#         print(f'{mon} has 28 or 29 days in it.')
#     else:
#         print('no match...')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#133. Залежно від розміру суми, розмір податку з неї розраховується за такою схемою:
# якщо сума не перевищує деяку величину a, то податок не вираховується;
# якщо сума більша за a, але не перевищує b, то податок становить 10%;
# якщо сума більша за b, але не перевищує c, то податок становить 25%;
# якщо сума більша c, то податок становить 50%.
# Визначити, який податок (дійсне число) буде вираховано із суми розміром s.
# Дані (цілі числа) вводяться в такому порядку: a, b, c, s.
#
# while True:
#
#     a = 500
#     b = 700
#     c = 1000
#     s = int(input('Enter your profit: '))
#     tex = 0
#     if s < a:
#         print(tex)
#     elif (s >= a) and (s < b):
#         tex = 10
#         tex_pay = s * (tex / 100)
#         print(tex_pay)
#     elif (s >= b) and (s < c):
#         tex = 25
#         tex_pay = s * (tex / 100)
#         print(tex_pay)
#     elif s >= c:
#         tex = 50
#         tex_pay = s * (tex / 100)
#         print(tex_pay)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#136. Подорожуючи на автомобілі, ви заїхали на автозаправну станцію.
# До наступної заправки 200 кілометрів. Напишіть програму, яка буде визначати,
# чи потрібно вам заправлятися або ж можна почекати до наступної станції.
# Програма повинна запитати:
# який розмір вашого бензобаку в літрах;
# скільки пального в бензобаку (у відсотках);
# скільки кілометрів проходить автомобіль на одному літрі палива.
# Результатом роботи програми має бути інформація про кількість кілометрів, які ще можна проїхати і
# почекати до наступної автозаправної станції, або негайно заправитись.
#
# gas_tank = 60
# fuel_in_the_gas_tank = 30
# gas_p_km = 8
# next_g_statione = 200
#
# fuel_in_the_gas_tank_l = gas_tank * (fuel_in_the_gas_tank / 100)
# km_left = fuel_in_the_gas_tank_l * gas_p_km
#
# if km_left < next_g_statione:
#     print(f'You can drive another {km_left} kilometers.\nNext refueling after {next_g_statione} kilometers.\nFILL IN NOW!')
# else:
#     print(f'You can drive another {km_left} kilometers.\nNext refueling after {next_g_statione} kilometers.\nFILL IN later')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#137. Дано натуральне число. Визначити, чи закінчується воно цифрою 5.
# while True:
#
#     number = int(input('Enter a number: '))
#     num = number % 5
#
#     if num == 0:
#         print(num == 0)
#     else:
#         print(num == 0)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#138. Дано три цілих числа. Необхідно надрукувати ті з них, які є парними.
#
# a = 4
# b = 5
# c = 6
#
# if (a % 2) == 0:
#     print(a)
# if (b % 2) == 0:
#     print(b)
# if (c % 2) == 0:
#     print(c)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#139. Перевірити, чи належить число, введене з клавіатури, інтервалу (-5, 3).
#
# num = int(input('Enter a number in the range -5 to 3: '))
#
# if (num >= -5) and (num <= 3):
#     print((num >= -5) and (num <= 3))
# else:
#     print((num >= -5) and (num <= 3))
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#140. Визначити, чи є число а дільником числа b або, навпаки, число b дільником числа a.
# a = 3
# b = 2
#
# c = a / b
# d = b / a
#
# if c >= 0:
#     print(c >= 0)
# if d >= 0:
#     print(d <= 0)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#141. Перевести число, введене користувачем, у байти або кілобайти в залежності від його вибору.
# Користувач вводить значення у мегабайтах і, відповідно, вводить напрямок переведення: B (у байти) або KB (у кілобайти).
# #
# #1 Кілобайт = 1024 Байт
# #1 Мегабайт = 1048576 Байт
#
# while True:
#     num = int(input('Enter a value of Megabyte: '))
#     num2 = input('To B or KB: ')
#     n = num2.upper()
#
#     kb = 1024
#     mb = 1048576
#
#     if n == "B":
#         in_b = num * mb
#         print(f'{num} MB = {in_b} B')
#     if n == "KB":
#         in_kb = num * kb
#         print(f'{num} MB = {in_kb} KB')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#143. Ігрове поле рулетки поділено на номери від 0 до 36, які мають чорний, червоний або зелений кольори.
# Номер 0 має зелений колір,
# для номерів від 1 до 10, непарні номери - червоні, а парні - чорні.
# Непарні номери від 11 до 18 - чорні, а парні номери - червоні.
# Непарні номери від 19 до 28 - червоні, а парні номери - чорні.
# Непарні номери від 29 до 36 - чорні, а парні номери - червоні.
# Напишіть програму, яка отримує номер (число від 0 до 36) та показує, чи є номер зеленим, червоним або чорним.
# Програма повинна враховувати варіант, якщо користувач вводить номер, який знаходиться за межами діапазону від 0 до 36.
#
# Я хочу написати схоже на автомат рулетку
# from random import*
#
# while True:
#
#
#     players_number = int(input('Enter your number: '))
#     players_color = input('Enter your color: ')
#     play_num = players_number % 2
#
#     win_num = randint(0, 36)
#     win_color = win_num % 2
#
#     if win_color == 0:
#         win_color = 'even'
#     else:
#         win_color = 'odd'
#
#     if win_num == 0:
#         print(f"Green {win_num}")
#
#     # від 1 до 10, непарні - червоні, а парні - чорні.
#     if (win_num >= 1) and (win_num <= 10) and (win_color == 'even'):
#         color = "Black"
#         print(f'{color} {win_num}')
#         if players_color == color:
#             print(f'Your color {players_color} - WIN!!!')
#     elif(win_num >= 1) and (win_num <= 10) and (win_color == 'odd'):
#         color = "Red"
#         print(f'{color} {win_num}')
#         if players_color == color:
#             print(f'Your color {players_color} - WIN!!!')
#
#     # від 11 до 18 непарні - чорні, а парні - червоні.
#     if (win_num >= 11) and (win_num <= 18) and (win_color == 'even'):
#         color = "Red"
#         print(f'{color} {win_num}')
#         if players_color == color:
#             print(f'Your color {players_color} - WIN!!!')
#     elif(win_num >= 11) and (win_num <= 18) and (win_color == 'odd'):
#         color = "Black"
#         print(f'{color} {win_num}')
#         if players_color == color:
#             print(f'Your color {players_color} - WIN!!!')
#
#     # від 19 до 28 непарні - червоні, а парні - чорні.
#     if (win_num >= 19) and (win_num <= 28) and (win_color == 'even'):
#         color = "Black"
#         print(f'{color} {win_num}')
#         if players_color == color:
#             print(f'Your color {players_color} - WIN!!!')
#     elif(win_num >= 19) and (win_num <= 28) and (win_color == 'odd'):
#         color = "Red"
#         print(f'{color} {win_num}')
#         if players_color == color:
#             print(f'Your color {players_color} - WIN!!!')
#
#     # від 29 до 36 непарні - чорні, а парні - червоні.
#     if (win_num >= 29) and (win_num <= 36) and (win_color == 'even'):
#         color = "Red"
#         print(f'{color} {win_num}')
#         if players_color == color:
#             print(f'Your color {players_color} - WIN!!!')
#     elif(win_num >= 29) and (win_num <= 36) and (win_color == 'odd'):
#         color = "Black"
#         print(f'{color} {win_num}')
#         if players_color == color:
#             print(f'Your color {players_color} - WIN!!!')
#
#
#     if players_number == win_num:
#         print(f'{win_num} you win')
#     else:
#         print(f'your number {players_number} lose')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#144. На станції ремонту автомобілів працює кілька працівників.
# Якщо який-небудь працівник працює понад 40 годин на тиждень, він отримує в 1,5 рази більше від звичайної погодинної оплати.
# Розробіть програму, яка розраховує заробітну плату працівника, включаючи оплату за додаткові години.
# Програма отримує на вхід два цілих числа - кількість робочих годин і ставку погодинної оплати.
#
# hours = 45
# rait = 15
#
# if hours > 40:
#     pay1 = (40 * rait)
#     pay2 = (hours - 40) * (rait * 1.5)
#     pay = pay1 + pay2
#     print(f'rait = {pay1}\nextra rait = {pay2}\npay = {pay}')
# else:
#     pay = hours * rait
#     print(f'rait = {pay}')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#146. Дано дві точки: A (x1, y1) і B (x2, y2).
# Напишіть програму, яка визначає, яка із точок знаходиться далі від початку координат.
# x1 = 2
# y1 = 2
#
# x2 = 2
# y2 = 3
#
# a = x1 + y1
# b = x2 + y2
#
# if a > b:
#     print('A')
# elif a < b:
#     print('B')
# else:
#     print('The distance is the same')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#147. Вводяться координати (x, y) точки A і радіус кола (r).
# Визначити, чи належить дана точка колу, якщо його центр знаходиться в початку координат.
# x1 = -2
# y1 = 5
#
# r = 3
#
# x2 = r
# y2 = r
#
# a = abs(x1) + abs(y1)
# b = x2 + y2
#
# if a > b:
#     print('The point is outside the circle')
# elif a <= b:
#     print('The point belongs to the circle')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#148. Дано натуральное число. Визначити, чи закінчується число парною цифрою.
#
# number = 35
#
# num = number % 2
#
# if num == 0:
#     print(num == 0)
# else:
#     print(num == 0)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#149. Дано трицифрове число. Визначити, чи рівний квадрат суми цифр числа сумі кубів його цифр.
#
# number = 150
# num = str(number)
#
# a = int(num[0])
# b = int(num[1])
# c = int(num[2])
#
# var1 = (a + b + c)**2
# var2 = a**3 + b**3 + c**3
#
# if var1 == var2:
#     print(var1 == var2)
# else:
#     print(var1 == var2)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#150. Розробіть програму-резюме, яка за введеними початковими даними і порядковим номером виводить таку інформацію:
# 1 - прізвище,
# 2 - ім’я,
# 3 - вік,
# 4 - хобі,
# 5 - номер телефону
# f_name = (input('Name: ')).capitalize()
# s_name = (input('Second name:')).capitalize()
# age = input('Age: ')
# hobby = (input('Hobby: ')).capitalize()
# number = input('Phone: ')
# num = int(input('Enter a choice: '))
#
# if num == 1:
#     print(f_name)
# elif num == 2:
#     print(s_name)
# elif num == 3:
#     print(age)
# elif num == 4:
#     print(hobby)
# elif num == 5:
#     print(number)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#151. Дано ціле число k (1 ≤ k ≤ 365). Визначити, яким буде k-й день року:
# вихідним (субота або неділя) або робочим, якщо 1 січня - понеділок.
#
# number = int(input('choice a day: '))
#
# a = 6
# b = 7
#
# lst_a = []
# lst_b = []
#
# while a <= 365:
#     a = a + 7
#     lst_a.append(a)
# while b <= 365:
#     b = b + 7
#     lst_b.append(b)
#
# if number in lst_a:
#     print('day off')
# elif number in lst_b:
#     print('day off')
# else:
#     print('working day')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#152. Прямокутник на площині, зі сторонами, паралельними координатним осям,
# заданий координатами лівої верхньої і правої нижньої своїх вершин.
# Також дані координати точки. Усі координати - цілі числа.
# Визначити, чи належить вказана точка заданому прямокутнику.
#
# x1 = 1
# y1 = 7
#
# x2 = 10
# y2 = 2
#
# x = 3
# y = 3
#
# if ((x >= x1) and (x <= x2)) and ((y <= y1) and(y >= y2)):
#     print('Yes')
# else:
#     print('No')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#153. Визначити чверть координатної площини, якій належить точка A з координатами (x1, y1).
# Відомо, що координати не рівні нулю і є цілими числами.
# while True:
#     x = int(input('Enter X:'))
#     y = int(input('Enter Y:'))
#
#     if x == 909:
#         print('STOP')
#         break
#
#     if (x > 0) and (y > 0):
#         print('I')
#     elif (x < 0) and (y > 0):
#         print('II')
#     elif (x < 0) and (y < 0):
#         print('III')
#     elif (x > 0) and (y < 0):
#         print('IV')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#154. Визначити, чи увійде в конверт з внутрішніми розмірами a і b мм прямокутна листівка з розмірами с і d мм.
# # Для розміщення листівки в конверті необхідний проміжок в 1 мм з кожної сторони. Значення сторін листівки і конверту - цілі числа.
#
# a = 5
# b = 6
#
# c = 4
# d = 5
#
# if (a > c) and (b > d):
#     print('y')
# else:
#     print('n')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#155. Розробити програму-довідник, яка за введеним значенням радіуса r пропронуватиме користувачу допомогу в обчисленні n (номер послуги):
# 1 - довжини кола,
# 2 - площі круга,
# 3 - об’єму кулі,
# 4 - площі поверхні кулі.
# Дані вводять в такому порядку: r, n.
# import math
#
# r = int(input('Введіть радіус: '))
# print('Оберіть варінт обчислення:\n1 - довжини кола\n2 - площі круга\n3 - об’єму кулі\n4 - площі поверхні кулі')
#
# count = 0
#
# while count < 1:
#     num = int(input('Ваш вибір: '))
#
#     if (num >= 1) and (num <= 4):
#         count = count + 1
#         # 1 - довжини кола,
#         if num == 1:
#             c = 2 * round(math.pi,2) * r
#             print('довжини кола: ',round(c, 2))
#
#         # 2 - площі круга,
#         elif num == 2:
#             s = round(math.pi,2) * (r**2)
#             print('площі круга: ',round(s, 2))
#
#         # 3 - об’єму кулі,
#         elif num == 3:
#             v = ((3/4) * round(math.pi,2)) * r**3
#             print('об’єму кулі: ',round(v, 2))
#         # 4 - площі поверхні кулі.
#         elif num == 4:
#             s2 = (4 * round(math.pi,2)) * r**3
#             print('площі поверхні кулі: ',round(s2, 2))
#
#     else:
#         print('Будь ласка, введіть номер варанту з представлених\nДавайте ще раз спробуєм')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#158. Дано двоцифрове число. Визначити, чи є сума його цифр двоцифровим числом.
#
# number = 15
#
# num = str(number)
#
# a = num[0]
# b = num[1]
#
# c = int(a) + int(b)
#
# d = str(c)
#
# if len(d) >= 2:
#     print(len(d) >= 2)
# else:
#     print(len(d) >= 2)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# #159. Дано двоцифрове число. Визначити, яка з його цифр більше: перша (вивести 1) або друга (вивести 2), або цифри рівні (вивести =).
#
# num = 22
#
# a = num // 10
# b = num % 10
#
# if a > b:
#     print('1')
# elif a < b:
#     print('2')
# elif a == b:
#     print('=')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#160. Дано натуральне число n (1 ≤ n ≤ 9999), що визначає вартість товару в копійках.
# Подайте вартість у гривнях і копійках.
# Якщо у результаті виходить 0 копійок, то замість цього значення необхідно записати порожній рядок.
# price = 1200
#
# a = price // 100 #гривні
# b = price % 100 #копійки
#
# if b == 0:
#     print(a,' ')
# else:
#     print(a, b)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#161. Відомі рік і номер місяця народження людини, а також рік і номер місяця сьогоднішнього дня (січень - 1 і т. д.).
# Визначити вік людини (число повних років). У разі збігу вказаних номерів місяців вважати, що пройшов повний рік.
#
# year_p = 1998
# month_p = 3
#
# year = 2018
# month = 2
#
# if month < month_p:
#     a = (year - year_p) - 1
#     print(a)
# else:
#     a = year - year_p
#     print(a)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#163. Уявіть будинок, побудований у футуристичному стилі, в якому є трикутні, прямокутні і круглі кімнати.
# Щоб швидко обчислити площу житлового приміщення, потрібно написати програму, на вхід якої подаються тип кімнати
# трикутник (triangle),
# прямокутник (rectangle),
# коло (circle)
# та відповідні параметри, за допомогою яких можна обчислити площу кімнати вказаної форми.
# Зверніть увагу, що кількість параметрів для обчислення площі для різних фігур є різною.
# import math
#
# num_of_room = int(input('Скільки кімнат у вашому будинку: '))
# print('Далі треба ввести форму кімнати та її розміри...')
# count = 0
# v = []
#
# while count < num_of_room:
#
#     count = count + 1
#     room = input("Enter a shape of room: ")
#
#     # трикутник (triangle)
#     if room == 'triangle':
#         print('Введіть розміри сторін кімнати')
#         a = int(input('Розмір 1-ї сторони: '))
#         b = int(input('Розмір 2-ї сторони: '))
#         c = int(input('Розмір 3-ї сторони: '))
#
#         p = (a + b + c) / 2
#         triangle = (p * (p - a) * (p - b) * (p - c))**0.5
#         v.append(triangle)
#
#         print(f'Площа цієї кімнати = {triangle} м.кв.')
#     # прямокутник (rectangle)
#     elif room == 'rectangle':
#         print('Введіть розміри сторін кімнати')
#         a = int(input('Розмір 1-ї сторони: '))
#         b = int(input('Розмір 2-ї сторони: '))
#
#         rectangle = a * b
#         v.append(rectangle)
#         print(f'Площа цієї кімнати = {rectangle} м.кв.')
#     # коло (circle)
#     elif room == 'circle':
#         print('Введіть радіус кімнати')
#         r = int(input('Pадіус: '))
#
#         circle = round(math.pi,2) * (r**2)
#         v.append(circle)
#         print(f'Площа цієї кімнати = {circle} м.кв.')
#
#
# print('Загальна площа будинку =',sum(v),'м.кв.')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#164. Напишіть програму для розрахунку індексу маси тіла, який обчислюється за формулою: індекс = маса / ( зріст * зріст).
# Користувач вводить значення зросту (у метрах) і маси (у кілограмах),
# а програма обчислює індекс маси тіла і виводить відповідне повідомлення:
# underweight (мала маса, індекс менше 18.5),
# normal weight (нормальна маса, індекс 18.5-24.9),
# overweight (надмірна маса, індекс 25.0-29.9).
# adiposity (ожиріння, індекс більше 30.0)
#
# m = float(input('Ваша вага: '))
# t = float(input('Ваш зріст в м та см через крапку: '))
#
# i = round(m / t**2, 2)
#
# if i < 18.5:
#     print(f'Your body mass index is: {i} , that is underweight.')
# elif 18.5 <= i < 25:
#     print(f'Your body mass index is: {i} , that is normal weight.')
# elif 25 <= i < 30:
#     print(f'Your body mass index is: {i} , that is overweight.')
# elif i >= 30:
#     print(f'Your body mass index is: {i} , that is adiposity.')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#165. Напишіть програму простого калькулятора, яка зчитує введені користувачем три рядки:
# перше число, друге число і арифметичну дію, після чого застосовує введену дію до введених числах і виводить результат.
# Калькулятор повинен підтримувати такі арифметичні дії як: +, -, /, *, mod (залишок від ділення),
# pow (піднесення до степеня), div (цілочисельне ділення).
# Якщо виконується ділення і друге число дорівнює 0, необхідно виводити рядок Division by 0!. Введені числа є дійсними.
# while True:
#     try:
#         a = float(input(''))
#         b = input('')
#         c = float(input(''))
#
#         if b =='+':
#             res = a + c
#             print(f'= {res}')
#         elif b =='-':
#             res = a - c
#             print(f'= {res}')
#         elif b =='*':
#             res = a * c
#             print(f'= {res}')
#         elif b =='/':
#             if c == 0:
#                 print('ти дебіл, на нуль не дільться...')
#             else:
#                 res = a / c
#                 print(f'= {res}')
#         elif b =='//':
#             if c == 0:
#                 print('ти дебіл, на нуль не дільться...')
#             else:
#                 res = a // c
#                 print(f'= {res}')
#         elif b =='%':
#             res = a % c
#             print(f'= {res}')
#         elif b =='**':
#             res = a ** c
#             print(f'= {res}')
#     except:
#         print('хуйню ти написав, давай ще раз')
#         continue
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#167. Дано натуральне число. Визначити, чи є воно двоцифровим.
# num = 424242
# if 10 <= num <= 99:
#     print('True')
# else:
#     print('False')
#*******************************************************************************************************************
# num = 4
# n = len(str(num))
# if n == 2:
#     print('True')
# else:
#     print('False')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#168. Дано трицифрове ціле число. Визначити суму першої і останньої цифр числа і порівняти її із значенням другої цифри числа.
# Відповідно вивести повідомлення: >, < і =.
# num  = 263
#
# a = num // 100
# b = (num // 10) % 10
# c = num % 10
#
# s = a + c
#
# if s > b:
#     print('>')
# elif s < b:
#     print('<')
# elif s == b:
#     print('=')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#169. Напишіть програму, у яку вводяться трицифрове ціле число і цифра.
# Необхідно визначити, чи входить у число введена цифра.
# f_num = int(input(': '))
# s_num = int(input(': '))
#
# a = f_num // 100
# b = (f_num // 10) % 10
# c = f_num % 10
#
# if s_num == a:
#     print('True')
# elif s_num == b:
#     print('True')
# elif s_num == c:
#     print('True')
# else:
#     print('False')
#****************************************************************************************************************
# f_num = int(input(': '))
# s_num = int(input(': '))
#
# a = f_num // 100
# b = (f_num // 10) % 10
# c = f_num % 10
#
# lst = [a, b, c]
#
# if s_num in lst:
#     print('True')
# else:
#     print('False')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#170. Дано трицифрове ціле число. Визначити кількість однакових цифр у записі числа і вивести значення цієї кількості.
# number = int(input(': '))
#
# num1 = number // 100
# num2 = (number // 10) % 10
# num3 = number % 10
#
# if num1 == num2 == num3:
#     count = 3
# elif num1 == num2 or num2 == num3 or num1 == num3:
#     count = 2
# else:
#     count = 0
#
# print(count)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#171. Трикутник на координатній площині заданий цілочисельними координатами своїх вершин, які не лежать на одній прямій.
# Користувач вводить координати трьох вершин трикутника (три пари чисел), а програма, відповідно,
# має вивести Yes або No на питання, чи є трикутник прямокутним.
# x1 = 1
# y1 = 7
#
# x2 = 7
# y2 = 7
#
# x3 = 1
# y3 = 1
#
# a = ((x2 - x1)**2 + (y2 - y1)**2)**0.5
# b = ((x3 - x2)**2 + (y3 - y2)**2)**0.5
# c = ((x3 - x1)**2 + (y3 - y1)**2)**0.5
#
# if a**2 + b**2 == round(c**2, 2) or c**2 + b**2 == round(a**2, 2) or a**2 + c**2 == round(b**2, 2):
#     print('Yes')
# else:
#     print('No')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#172. Напишіть програму, яка отримує на вхід ціле число,
# і виводить True, якщо передане значення потрапляє в інтервал (-15,12] ∪ (14,17) ∪ [19, + ∞)
# і False в іншому випадку. З
# верніть увагу на різні дужки, які використовуються для позначення інтервалів.
#
# n = 1265465363489465445646
#
# if ((n > -15) and (n <= 12)) or ((n > 14) and (n < 17)) or ((n >= 19) and (n < float('inf'))):
#     print('True')
# else:
#     print('False')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#174. Потрібно визначити, чи є даний рік високосним.
# Нагадаємо, що високосними роками вважаються ті роки, порядковий номер яких або кратний 4,
# але при цьому не кратний 100, або кратний 400 (наприклад, 2000-й рік був високосним, а 2100-й буде невисокосним роком).
# Програма повинна коректно працювати на числах 1900 ≤ n ≤ 3000. Виведіть Leap year. в разі, якщо рік є високосним,
# і Ordinary year. у протилежному випадку.
#
# year = 2000
#
# from_year = 1900
# to_year = 3000
#
# leap = []
#
# for y in range(from_year, to_year):
#     if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:
#         leap.append(y)
#
# if year in leap:
#     print('Leap year.')
# else:
#     print('Ordinary year.')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#176. Дано чотирицифрове число. Замінити усі парні цифри числа на символ * і вивести число.
# number = 2358
# num = str(number)
# n = list(num) #можна зайвий раз не перетворювати
#
# lst = []
#
# for i in n:
#     i = int(i)
#     if (i%2) == 0:  #if int(i) % 2 == 0:
#         i = "*"
#         lst.append(i)
#     else:
#         i = str(i)
#         lst.append(i)
#
# e = ''.join(lst)
# print(e)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#177. Дано натуральне число n (n ≤ 9999). З’ясувати, чи різні усі чотири цифри цього числа (з урахуванням чотирьох цифр).
# Наприклад, в числі 5623 усі цифри різні, в числі 0012 - ні.
# number = 1234
# n = list(str(number).rjust(4,'0'))
#
# if n[0] == n[1] or n[0] == n[2] or n[0] == n[3] or n[1] == n[2] or n[1] == n[3] or n[2] == n[3]:
#     print('True')
# else:
#     print('False')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#178. Робота світлофора для пішоходів запрограмована таким чином:
# на початку кожної години протягом трьох хвилин горить зелений сигнал,
# потім протягом двох хвилин - червоний, а потім протягом трьох хвилин - знову зелений і т. д.
# Дано ціле число t, що означає час в хвилинах, що минув від початку чергової години.
# Визначити, сигнал якого кольору горить для пішоходів в цей момент.
#
# num = 26
# lst = list(range(0, 60))
# l = len(lst)
#
# green = []
# red = []
# while l > 0:
#     green.extend(lst[0:3])
#     del lst[0:3]
#
#     red.extend(lst[0:2])
#     del lst[0:2]
#
#     l = len(lst)
#
# if num in green:
#     print('Green')
# if num in red:
#     print('Red')
#*******************************************************************************************************************
# num = 26
# lst = list(range(0, 60))
#
# green = []
# red = []
#
# while lst:
#     green.extend(lst[0:3])
#     del lst[0:3]
#
#     red.extend(lst[0:2])
#     del lst[0:2]
#
# if num in green:
#     print('Green')
# if num in red:
#     print('Red')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#179. Робота світлофора для водіїв запрограмована таким чином:
# на початку кожної години протягом трьох хвилин горить зелений сигнал,
# потім протягом однієї хвилини - жовтий,
# потім протягом двох хвилин - червоний,
# а далі протягом трьох хвилин - знову зелений і т. д.
# Дано ціле число t, що позначає час у хвилинах, що минув з початку чергової години.
# Визначити, сигнал якого кольору горить для водіїв в цей момент.
#
# num = 5
# lst = list(range(1, 61))
#
# yellow = []
# green = []
# red = []
#
# while lst:
#     green.extend(lst[:3])
#     del lst[:3]
#
#     yellow.extend(lst[:1])
#     del lst[:1]
#
#     red.extend(lst[:2])
#     del lst[:2]
#
# if num in green:
#     print('Green')
# if num in yellow:
#     print('Yellow')
# if num in red:
#     print('Red')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#180. Дано чотирицифрове число. Перевірте, чи є воно паліндромом.
# Паліндромом називається число, слово або текст, які однаково читаються зліва направо і справа наліво.
# Наприклад, в нашому випадку, числами-паліндромами будуть: 1221, 4444, 9119 і т. д.
# Приклади інших цілих чисел-паліндромів, що не відносяться до розв’язуваної задачі: 2, 454, 33, 91219 і т. д.
#
# number = 1222
#
# num = str(number)
#
# n1 = num[:2]
#
# n2 = num[2:]
#
# n3 = n2[::-1]
#
# if n1 == n3:
#     print(n1 == n3)
# else:
#     print(n1 == n3)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#182. Напишіть програму, у якій користувач вводить значення поточної дати: день, місяць і рік (цілі числа),
# а програма виводить завтрашню дату у форматі: дд.мм.рррр.
#
# day = 5
# month = 7
# year = 2019
#
# big = [1, 3, 5, 7, 8, 10]
# small = [4, 6, 9, 11]
# l = 2
# n_y = 12
#
# leap = []
#
# for y in range(1800, 3000):
#     if ((year%4 == 0) and (year%100 != 0)) or (year%400 == 0):
#         leap.append(y)
#
# if year in leap:
#     if month in big and day < 31:
#         day = day + 1
#     elif month in small and day < 30:
#         day = day + 1
#     elif month == 2 and day < 29:
#         day = day + 1
#     elif month == 12 and day < 31:
#         day = day + 1
#     elif month == 12 and day == 31:
#         day = 1
#         month = 1
#         year = year + 1
#     else:
#         day = 1
#         month = month + 1
#
#     print(day, month, year, sep='.')
#
# else:
#     if month in big and day < 31:
#         day = day + 1
#     elif month in small and day < 30:
#         day = day + 1
#     elif month == 2 and day < 28:
#         day = day + 1
#     elif month == 12 and day < 31:
#         day = day + 1
#     elif month == 12 and day == 31:
#         day = 1
#         month = 1
#         year = year + 1
#     else:
#         day = 1
#         month = month + 1
#
#     print(day, month, year, sep='.')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#185. Дано три цілих числа. Упорядкуйте їх у порядку зростання. Програма повинна зчитувати три числа a, b, c.
# Далі програма повинна змінювати їх значення так, щоб стали виконані умови a ≤ b ≤ c.
# Резельтатом роботи програми буде виведення трійки чисел a, b, c в одному рядку.
# При розв’язуванні задачі не можна використовувати додаткові змінні,
# тобто єдиною допустимою операцією присвоювання є обмін значень двох змінних типу (a, b) = (b, a).
#
# a = 3
# b = 1
# c = 2
#
# if a >= b >= c:
#     print(a, b, c)
# elif a >= c >= b:
#     print(a, c, b)
# elif b >= a >= c:
#     print(b, a, c)
# elif b >= c >= a:
#     print(b, c, a)
# elif c >= b >= a:
#     print(c, b, a)
# elif c >= a >= b:
#     print(c, a, b)
#***************************************************************************************************************
# a = 3
# b = 1
# c = 2
# lst = [a, b, c]
# new_lst = lst.sort()
# print(lst)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#187. Визначити максимальну і мінімальну цифри із введеного трицифрового числа і
# вивести цифри в одному рядку через пропуск. Якщо цифри однакові, то вивести лише одну цифру.
# number = 244
# num = str(number)
# n = list(num)
#
# ma = max(n)
# mi = min(n)
#
# if ma == mi:
#     print(ma)
# else:
#     print(ma, mi)
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#189. Напишіть програму, у якій до введеного числа додаються написи:
# «гривень» (hryven),
# «гривня» (hryvnia),
# «гривні» (hryvni),
# згідно з правилами українського правопису.
#
# num = 1235
# n = str(num)
#
# if n == '11' or n == '12' or n == '13' or n == '14':
#     print(f'{num} hryven 1')
# elif n[-1] == '1':
#     print(f'{num} hryvnia 2')
# elif n[-1:] == '2' or n[-1:] == '3' or n[-1:] =='4':
#     print(f'{num} hryvni {n[-2:]} 3')
# elif n[-1:] == '0' or n[-1:] == '5' or n[-1:] == '6' or n[-1:] == '7' or n[-1:] == '8' or n[-1:] == '9':
#     print(f'{num} hryven 4')
#//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#


